Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/the_president/index.html.txt.tmx
Source language: en
Languages: ga

source: The head of State is called the President
ga: Tugtar an teideal Uachtarán ar cheann Stáit na hÉireann

source: Introducing the office of the Irish President
ga: Tugann an cháipéis seo cur síos gairid ar an Uachtarán

source: The head of State in Ireland is known as the President
ga: Tugtar an teideal Uachtarán ar Cheann Stáit na hÉireann

source: Find out about the important functions of the Irish President
ga: Faigh amach tuilleadh faoi na feidhmeanna tábhachtacha an tUachtarán Éireannach

source: President - Summoning and dissolving the Dáil
ga: An tUachtarán - an Dáil a chomóradh agus a lánscoir

source: This document describes the functions of the President in summoning and dissolving the Dail
ga: Tá cur síos sa cháipéis seo ar fheidhmeanna an Uachtaráin maidir leis an Dáil a chomóradh agus a lánscoir

source: President - Convening the Oireachtas
ga: An tUachtarán - Tithe an Oireachtais a Chomóradh

source: This document describes the President of Ireland's power to convene a meeting of either or both Houses of the Oireachtas
ga: Tá cur síos anseo ar chumhacht an Uachtaráin ceachtar de Thithe an Oireachtais, nó iad araon, a chomóradh

source: President of Ireland and legislation
ga: An tUachtarán agus reachtaíocht

source: The President of Ireland has certain powers in relation to legislation
ga: Tá cumhachtaí áirithe ag an Uachtarán maidir le reachtaíocht

source: Overview of President's powers
ga: Forbhreathnú cumhachtaí an tUachtarán

source: Inauguration and removal of the President
ga: Uachtarán a gharim agus a chur as oifig

source: This document describes the inauguration of the President of Ireland and the circumstances in which the President may be removed from office
ga: Tá cur síos sa cháipéis seo ar Uachtarán a ghairm agus ar na cuinsí inar féidir an tUachtarán a chur as oifig

source: President - representing the people
ga: An tUachtarán - ionadaí na ndaoine

source: The President's role in representing the people of Ireland
ga: Tá cur síos sa chápéis seo ar ról an Uachtaráin mar Ionadaí na nDaoine

source: The Council of State is an advisory group that aids and counsels the President
ga: Cur síos atá anseo ar an gComhairle Stáit a chuireann cúnamh agus comhairle ar fáil don Uachtarán

source: The Presidential Commission steps in to perform the duties of the President if they are absent, ill or in the event of death or resignation of the President
ga: Comhlíonfaidh Coimisiún an Uachtaráin dualgais an Uachtaráin má bhíonn siad as láthair, ar míthreoir nó má chailltear iad nó má éiríonn iad as oifig

source: The President has an important role in appointing people to various offices of State
ga: Tá ról tábhachtach ag an Uachtarán i gceapadh daoine chun oifigí Stáit éagsúla

source: President and the Defence Forces
ga: An tUachtarán agus na Fórsaí Cosanta

source: The President's role as Supreme Commander of the Defence Forces in Ireland
ga: Tá cur síos anseo ar an Uachtarán mar Ardcheannasaí na bhFórsaí Cosanta

source: President's Award - Gaisce
ga: Gradam an Uachtaráin – Gaisce

source: The President's Award is the President's 'National Challenge' Award made to young people in Ireland between the ages of 15 and 25 years
ga: Tá plé déanta sa cháipéis seo ar Dhuais an Uachtaráin, Duais Náisiúnta Dúshláin an Uachtaráin a bhronntar ar dhaoine óga idir 15 agus 25 bliain d'aois

source: Most Read in "Government in Ireland"
ga: Ábhar is mó éilimh i "Rialtas in Éirinn"

source: Presidential Election in Ireland
ga: Bunchearta faoi Bhunreacht na hÉireann
